# Assignment 2

### Exercise 1: Basic Dictionary Creation and Access
Objective: Create a dictionary named student_info containing at least three key-value pairs where keys are student names (as strings) and values are their respective ages (as integers). Then, access and print the age of a specific student.

### Exercise 2: Modifying Dictionary Values
**Objective:** Start with a dictionary `product_prices` where keys are product names (strings) and values are their prices (floats). Select a product and update its price. Then, add a new product with its price to the dictionary.

In [ ]:
# Initial product prices
product_prices = {
    "Laptop": 999.99,
    "Smartphone": 499.99,
    "Headphones": 89.99,
    "Camera": 279.99
}

### Exercise 3: Dictionary Comprehension
**Objective:** Create a dictionary `squared_numbers` using dictionary comprehension where keys are integers from 1 to 10, and values are the squares of these keys.

### Exercise 4: Nested Dictionaries
**Objective:** Create a nested dictionary `employee_data` where each key is an employee ID (integer) and each value is another dictionary with keys 'Name', 'Position', and 'Salary'. Then, access and print the name and position of a specific employee by their ID. This dictionary `employee_data` should have only 5 keys.

If we want to create nested dictionaries, the procedure is quite simple: instead of puting a value in the values place we put new brackets where we write the nested dictionarie.

In [51]:
employee_data = {
    "045": {
        'Name': 'Mariano Gutierrez',
        'Position': 'Project Manager',
        'Salary': 5000
    },  
    "047": {
        'Name': 'Andrea Gonzales',
        'Position': 'Business Analyst',
        'Salary': 3500
    },  
    "050": {
        'Name': 'Alejandra Espejo',
        'Position': 'Financial Management',
        'Salary': 6000
    }, 
    "053": {
        'Name': 'Kevin Garcia',
        'Position': 'Marketing Manager',
        'Salary': 4500
    }, 
    "060": {
        'Name': 'Anibal Benavides',
        'Position': 'Human Resources Manager',
        'Salary': 3000
    }
}

Then we have to print the elements in the nested dictionaries we have to first write in brackets the outer key and then the inner key like this: print (nested_dictionarie[outer_key][inner_key])

In [56]:
print(employee_data["050"]['Name'])

Alejandra Espejo

In [54]:
print(employee_data["050"]['Position'])

Financial Management


### Exercise 5: Merging Dictionaries
**Objective:** You have two dictionaries `dict1` and `dict2` with non-overlapping keys. Merge these two dictionaries into a new dictionary `merged_dict` and print its contents. This `merged_dict` dict should have all the keys.

In [57]:
dict1 = {"A": 1, "B": 2, "C": 3}
dict2 = {"D": 4, "E": 5, "F": 6}

There exist to methods for merging these to dicitonaries, one would be to update dict 1 adding dict 2. The other one is using the ** creatign a new dicitonarie, this is what we are going to do. We just have to write:

In [58]:
merged_dict = {**dict1, **dict2}
#Then we print
print(merged_dict)

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6}

## Pandas

In [60]:
# Creating a DataFrame for the exercise
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [62]:
#We import pandas an the convert the dictionarie into a Dataframe
import pandas as pd

In [69]:
Data_frame = pd.DataFrame(data)
Data_frame

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

### Exercise 1: Selecting Single Column with .loc
**Objective**: Use .loc to select and print only the 'Name' column for all rows.

### Exercise 2: Row Slicing with .iloc
**Objective**: Use .iloc to select and print rows 2 through 4 (inclusive).

### Exercise 3: Selecting Multiple Columns with .iloc
**Objective**: Use .iloc to select and print the 'Name' and 'Age' columns for all rows.

### Exercise 4: Conditional Selection with .loc
**Objective**: Use .loc to select and print rows where the 'Age' is greater than 30.

In this case with .loc we create a boolean condition where loc finds every value grater than 30, for this we write as it follows

In [72]:
More_30 = Data_frame.loc[Data_frame['Age']>30]

#Then we print the object where we saved the rows where Age is greater than 30
print(More_30)

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

### Exercise 5: Modifying Data with .loc
**Objective**: Use .loc to change the 'City' of the person named 'Alice' to 'Boston'. Then, print the updated DataFrame.

We first use the loc function to find Alice with DF.loc[DF[Name]]==Alice and then by the coma and closing the brackets
we are saying that we want to change the city column. Finally we write the new value after the equals sing so we can establish
the new value we want.

In [73]:
 Data_frame.loc[Data_frame['Name'] == 'Alice', 'City'] = 'Boston'

In [74]:
print(Data_frame)

      Name  Age         City
0    Alice   25       Boston
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami